Revit 2026 API

# DividedPathMeasurementType Enumeration

---

DividedPath measurement type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DividedPathMeasurementType
```
```vb
Public Enumeration DividedPathMeasurementType
```
```cpp
public enum class DividedPathMeasurementType
```
```fsharp
type DividedPathMeasurementType
```

| Member name | Value | Description |
| --- | --- | --- |
| ChordLength | 0 | Distances between two points are measured along a straight line between the points. |
| SegmentLength | 1 | Distances between two points are measured along the path segment between the points. |

#### Reference

Autodesk.Revit.DB Namespace